name: "ner_onnx"
platform: "onnxruntime_onnx"
max_batch_size: 32

input [
    {
        name: "input_ids"
        data_type: TYPE_INT64 
        dims: [-1] 
    },
    {
        name: "attention_mask"
        data_type: TYPE_INT64
        dims: [-1]
    }
]

output [
    {
        name: "logits"
        data_type: TYPE_FP32
        dims: [-1, 40] # NUM_LABELS=40  
    }
]

dynamic_batching {
    preferred_batch_size: [4, 8, 16]
    max_queue_delay_microseconds: 10000
}


